# Задание 1
number = int(input("Введите число"))
while number < 10:
    print(number)
    number += 1
print("программа завершена")

